class PlateFormatter {
  PlateFormatter._();

  static const Map<String, String> sudanStateCodes = {
    'خ': 'الخرطوم',
    'ج': 'الجزيرة',
    'ب': 'البحر الأحمر',
    'ن': 'نهر النيل',
    'ش': 'الشمالية',
    'ق': 'القضارف',
    'ك': 'كسلا',
    'س': 'سنار',
    'ن.أ': 'النيل الأبيض',
    'ن.ز': 'النيل الأزرق',
    'ش.ك': 'شمال كردفان',
    'ج.ك': 'جنوب كردفان',
    'غ.ك': 'غرب كردفان',
    'ش.د': 'شمال دارفور',
    'ج.د': 'جنوب دارفور',
    'غ.د': 'غرب دارفور',
    'و.د': 'وسط دارفور',
    'ش.ق': 'شرق دارفور',
  };

  static String getStateName(String code) {
    return sudanStateCodes[code] ?? 'السودان';
  }
}
